noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f5438a.h
/********************************************************************
*
* Standard register and bit definitions for the Texas Instruments
* MSP430 microcontroller.
*
* This file supports assembler and C development for
* MSP430x54xA devices.
*
* Texas Instruments, Version 1.4
*
* Rev. 1.0, Setup
* Rev. 1.1, added PM5CTL0
* Rev. 1.2, fixed wrong bit definition in PM5CTL0 (LOCKLPM5)
* Rev. 1.3, Changed access type of DMAxSZ registers to word only
* Rev. 1.4  Changed access type of TimerA/B registers to word only
*
********************************************************************/

#ifndef __msp430x54xA
#define __msp430x54xA

#define __MSP430_HEADER_VERSION__ 1059

#ifdef  __IAR_SYSTEMS_ICC__
#ifndef _SYSTEM_BUILD
#pragma system_include
#endif
#endif

#if (((__TID__ >> 8) & 0x7F) != 0x2b)     /* 0x2b = 43 dec */
#error msp430f5438a.h file for use with ICC430/A430 only
#endif


#ifdef __IAR_SYSTEMS_ICC__
#include "in430.h"
#pragma language=extended

#define DEFC(name, address) __no_init volatile unsigned char name @ address;
#define DEFW(name, address) __no_init volatile unsigned short name @ address;

#define DEFCW(name, address) __no_init union \
{ \
  struct \
  { \
    volatile unsigned char  name##_L; \
    volatile unsigned char  name##_H; \
  }; \
  volatile unsigned short   name; \
} @ address;

#define READ_ONLY_DEFCW(name, address) __no_init union \
{ \
  struct \
  { \
    volatile READ_ONLY unsigned char  name##_L; \
    volatile READ_ONLY unsigned char  name##_H; \
  }; \
  volatile READ_ONLY unsigned short   name; \
} @ address;


#if __REGISTER_MODEL__ == __REGISTER_MODEL_REG20__
#define __ACCESS_20BIT_REG__  void __data20 * volatile
#else
#define __ACCESS_20BIT_REG__  volatile unsigned short  /* only short access from C is allowed in small memory model */
#endif

#define DEFA(name, address) __no_init union \
{ \
  struct \
  { \
    volatile unsigned char  name##_L; \
    volatile unsigned char  name##_H; \
  }; \
  struct \
  { \
    volatile unsigned short name##L; \
    volatile unsigned short name##H; \
  }; \
  __ACCESS_20BIT_REG__ name; \
} @ address;

#endif  /* __IAR_SYSTEMS_ICC__  */


#ifdef __IAR_SYSTEMS_ASM__
#define DEFC(name, address) sfrb name = address;
#define DEFW(name, address) sfrw name = address;

#define DEFCW(name, address) sfrbw name, name##_L, name##_H, address;
sfrbw macro name, name_L, name_H, address;
sfrb name_L = address;
sfrb name_H = address+1;
sfrw name   = address;
      endm

#define READ_ONLY_DEFCW(name, address) const_sfrbw name, name##_L, name##_H, address;
const_sfrbw macro name, name_L, name_H, address;
const sfrb name_L = address;
const sfrb name_H = address+1;
const sfrw name   = address;
      endm

#define DEFA(name, address) sfrba name, name##L, name##H, name##_L, name##_H, address;
sfrba macro name, nameL, nameH, name_L, name_H, address;
sfrb name_L = address;
sfrb name_H = address+1;
sfrw nameL  = address;
sfrw nameH  = address+2;
sfrl name   = address;
      endm

#endif /* __IAR_SYSTEMS_ASM__*/

#ifdef __cplusplus
#define READ_ONLY
#else
#define READ_ONLY const
#endif

/************************************************************
* STANDARD BITS
************************************************************/

#define BIT0                (0x0001u)
#define BIT1                (0x0002u)
#define BIT2                (0x0004u)
#define BIT3                (0x0008u)
#define BIT4                (0x0010u)
#define BIT5                (0x0020u)
#define BIT6                (0x0040u)
#define BIT7                (0x0080u)
#define BIT8                (0x0100u)
#define BIT9                (0x0200u)
#define BITA                (0x0400u)
#define BITB                (0x0800u)
#define BITC                (0x1000u)
#define BITD                (0x2000u)
#define BITE                (0x4000u)
#define BITF                (0x8000u)

/************************************************************
* STATUS REGISTER BITS
************************************************************/

#define C                   (0x0001u)
#define Z                   (0x0002u)
#define N                   (0x0004u)
#define V                   (0x0100u)
#define GIE                 (0x0008u)
#define CPUOFF              (0x0010u)
#define OSCOFF              (0x0020u)
#define SCG0                (0x0040u)
#define SCG1                (0x0080u)

/* Low Power Modes coded with Bits 4-7 in SR */

#ifndef __IAR_SYSTEMS_ICC__ /* Begin #defines for assembler */
#define LPM0                (CPUOFF)
#define LPM1                (SCG0+CPUOFF)
#define LPM2                (SCG1+CPUOFF)
#define LPM3                (SCG1+SCG0+CPUOFF)
#define LPM4                (SCG1+SCG0+OSCOFF+CPUOFF)
/* End #defines for assembler */

#else /* Begin #defines for C */
#define LPM0_bits           (CPUOFF)
#define LPM1_bits           (SCG0+CPUOFF)
#define LPM2_bits           (SCG1+CPUOFF)
#define LPM3_bits           (SCG1+SCG0+CPUOFF)
#define LPM4_bits           (SCG1+SCG0+OSCOFF+CPUOFF)

#include "in430.h"

#define LPM0      _BIS_SR(LPM0_bits)     /* Enter Low Power Mode 0 */
#define LPM0_EXIT _BIC_SR_IRQ(LPM0_bits) /* Exit Low Power Mode 0 */
#define LPM1      _BIS_SR(LPM1_bits)     /* Enter Low Power Mode 1 */
#define LPM1_EXIT _BIC_SR_IRQ(LPM1_bits) /* Exit Low Power Mode 1 */
#define LPM2      _BIS_SR(LPM2_bits)     /* Enter Low Power Mode 2 */
#define LPM2_EXIT _BIC_SR_IRQ(LPM2_bits) /* Exit Low Power Mode 2 */
#define LPM3      _BIS_SR(LPM3_bits)     /* Enter Low Power Mode 3 */
#define LPM3_EXIT _BIC_SR_IRQ(LPM3_bits) /* Exit Low Power Mode 3 */
#define LPM4      _BIS_SR(LPM4_bits)     /* Enter Low Power Mode 4 */
#define LPM4_EXIT _BIC_SR_IRQ(LPM4_bits) /* Exit Low Power Mode 4 */
#endif /* End #defines for C */

/************************************************************
* CPU
************************************************************/
#define __MSP430_HAS_MSP430XV2_CPU__  /* Definition to show that it has MSP430XV2 CPU */

/************************************************************
* PERIPHERAL FILE MAP
************************************************************/

/************************************************************
* ADC12 PLUS
************************************************************/
#define __MSP430_HAS_ADC12_PLUS__     /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_ADC12_PLUS__ 0x0700

#define  ADC12CTL0_          (0x0700u)  /* ADC12+ Control 0 */
DEFCW(   ADC12CTL0         , ADC12CTL0_)
#define  ADC12CTL1_          (0x0702u)  /* ADC12+ Control 1 */
DEFCW(   ADC12CTL1         , ADC12CTL1_)
#define  ADC12CTL2_          (0x0704u)  /* ADC12+ Control 2 */
DEFCW(   ADC12CTL2         , ADC12CTL2_)
#define  ADC12IFG_           (0x070Au)  /* ADC12+ Interrupt Flag */
DEFCW(   ADC12IFG          , ADC12IFG_)
#define  ADC12IE_            (0x070Cu)  /* ADC12+ Interrupt Enable */
DEFCW(   ADC12IE           , ADC12IE_)
#define  ADC12IV_            (0x070Eu)  /* ADC12+ Interrupt Vector Word */
DEFCW(   ADC12IV           , ADC12IV_)

#define  ADC12MEM0_          (0x0720u)  /* ADC12 Conversion Memory 0 */
DEFCW(   ADC12MEM0         , ADC12MEM0_)
#define  ADC12MEM1_          (0x0722u)  /* ADC12 Conversion Memory 1 */
DEFCW(   ADC12MEM1         , ADC12MEM1_)
#define  ADC12MEM2_          (0x0724u)  /* ADC12 Conversion Memory 2 */
DEFCW(   ADC12MEM2         , ADC12MEM2_)
#define  ADC12MEM3_          (0x0726u)  /* ADC12 Conversion Memory 3 */
DEFCW(   ADC12MEM3         , ADC12MEM3_)
#define  ADC12MEM4_          (0x0728u)  /* ADC12 Conversion Memory 4 */
DEFCW(   ADC12MEM4         , ADC12MEM4_)
#define  ADC12MEM5_          (0x072Au)  /* ADC12 Conversion Memory 5 */
DEFCW(   ADC12MEM5         , ADC12MEM5_)
#define  ADC12MEM6_          (0x072Cu)  /* ADC12 Conversion Memory 6 */
DEFCW(   ADC12MEM6         , ADC12MEM6_)
#define  ADC12MEM7_          (0x072Eu)  /* ADC12 Conversion Memory 7 */
DEFCW(   ADC12MEM7         , ADC12MEM7_)
#define  ADC12MEM8_          (0x0730u)  /* ADC12 Conversion Memory 8 */
DEFCW(   ADC12MEM8         , ADC12MEM8_)
#define  ADC12MEM9_          (0x0732u)  /* ADC12 Conversion Memory 9 */
DEFCW(   ADC12MEM9         , ADC12MEM9_)
#define  ADC12MEM10_         (0x0734u)  /* ADC12 Conversion Memory 10 */
DEFCW(   ADC12MEM10        , ADC12MEM10_)
#define  ADC12MEM11_         (0x0736u)  /* ADC12 Conversion Memory 11 */
DEFCW(   ADC12MEM11        , ADC12MEM11_)
#define  ADC12MEM12_         (0x0738u)  /* ADC12 Conversion Memory 12 */
DEFCW(   ADC12MEM12        , ADC12MEM12_)
#define  ADC12MEM13_         (0x073Au)  /* ADC12 Conversion Memory 13 */
DEFCW(   ADC12MEM13        , ADC12MEM13_)
#define  ADC12MEM14_         (0x073Cu)  /* ADC12 Conversion Memory 14 */
DEFCW(   ADC12MEM14        , ADC12MEM14_)
#define  ADC12MEM15_         (0x073Eu)  /* ADC12 Conversion Memory 15 */
DEFCW(   ADC12MEM15        , ADC12MEM15_)
#define ADC12MEM_           ADC12MEM  /* ADC12 Conversion Memory */
#ifndef __IAR_SYSTEMS_ICC__
#define ADC12MEM            ADC12MEM0 /* ADC12 Conversion Memory (for assembler) */
#else
#define ADC12MEM            ((int*) &ADC12MEM0) /* ADC12 Conversion Memory (for C) */
#endif

