noccy80/mspdev/reference/MSP430ware/deprecated/IAR/msp430f5438a.h
/* UCBxIFG Control Bits */
#define UCNACKIFG           (0x0020u)  /* NAK Condition interrupt Flag */
#define UCALIFG             (0x0010u)  /* Arbitration Lost interrupt Flag */
#define UCSTPIFG            (0x0008u)  /* STOP Condition interrupt Flag */
#define UCSTTIFG            (0x0004u)  /* START Condition interrupt Flag */
#define UCTXIFG             (0x0002u)  /* USCI Transmit Interrupt Flag */
#define UCRXIFG             (0x0001u)  /* USCI Receive Interrupt Flag */

/* USCI Definitions */
#define USCI_NONE           (0x0000u)    /* No Interrupt pending */
#define USCI_UCRXIFG        (0x0002u)    /* USCI UCRXIFG */
#define USCI_UCTXIFG        (0x0004u)    /* USCI UCTXIFG */
#define USCI_I2C_UCALIFG    (0x0002u)    /* USCI I2C Mode: UCALIFG */
#define USCI_I2C_UCNACKIFG  (0x0004u)    /* USCI I2C Mode: UCNACKIFG */
#define USCI_I2C_UCSTTIFG   (0x0006u)    /* USCI I2C Mode: UCSTTIFG*/
#define USCI_I2C_UCSTPIFG   (0x0008u)    /* USCI I2C Mode: UCSTPIFG*/
#define USCI_I2C_UCRXIFG    (0x000Au)    /* USCI I2C Mode: UCRXIFG */
#define USCI_I2C_UCTXIFG    (0x000Cu)    /* USCI I2C Mode: UCTXIFG */

/************************************************************
* USCI A1
************************************************************/
#define __MSP430_HAS_USCI_A1__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A1__ 0x0600

#define UCA1CTLW0_          (0x0600u)  /* USCI A1 Control Word Register 0 */
DEFCW(  UCA1CTLW0         , UCA1CTLW0_)
#define UCA1CTL1            UCA1CTLW0_L  /* USCI A1 Control Register 1 */
#define UCA1CTL0            UCA1CTLW0_H  /* USCI A1 Control Register 0 */
#define UCA1BRW_            (0x0606u)  /* USCI A1 Baud Word Rate 0 */
DEFCW(  UCA1BRW           , UCA1BRW_)
#define UCA1BR0             UCA1BRW_L /* USCI A1 Baud Rate 0 */
#define UCA1BR1             UCA1BRW_H /* USCI A1 Baud Rate 1 */
#define UCA1MCTL_           (0x0608u)  /* USCI A1 Modulation Control */
DEFC(   UCA1MCTL          , UCA1MCTL_)
#define UCA1STAT_           (0x060Au)  /* USCI A1 Status Register */
DEFC(   UCA1STAT          , UCA1STAT_)
#define UCA1RXBUF_          (0x060Cu)  /* USCI A1 Receive Buffer */
READ_ONLY DEFC( UCA1RXBUF      , UCA1RXBUF_)
#define UCA1TXBUF_          (0x060Eu)  /* USCI A1 Transmit Buffer */
DEFC(   UCA1TXBUF         , UCA1TXBUF_)
#define UCA1ABCTL_          (0x0610u)  /* USCI A1 LIN Control */
DEFC(   UCA1ABCTL         , UCA1ABCTL_)
#define UCA1IRCTL_          (0x0612u)  /* USCI A1 IrDA Transmit Control */
DEFCW(  UCA1IRCTL         , UCA1IRCTL_)
#define UCA1IRTCTL          UCA1IRCTL_L  /* USCI A1 IrDA Transmit Control */
#define UCA1IRRCTL          UCA1IRCTL_H  /* USCI A1 IrDA Receive Control */
#define UCA1ICTL_           (0x061Cu)  /* USCI A1 Interrupt Enable Register */
DEFCW(  UCA1ICTL          , UCA1ICTL_)
#define UCA1IE              UCA1ICTL_L  /* USCI A1 Interrupt Enable Register */
#define UCA1IFG             UCA1ICTL_H  /* USCI A1 Interrupt Flags Register */
#define UCA1IV_             (0x061Eu)  /* USCI A1 Interrupt Vector Register */
DEFW(   UCA1IV            , UCA1IV_)


/************************************************************
* USCI B1
************************************************************/
#define __MSP430_HAS_USCI_B1__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B1__ 0x0620


#define UCB1CTLW0_          (0x0620u)  /* USCI B1 Control Word Register 0 */
DEFCW(  UCB1CTLW0         , UCB1CTLW0_)
#define UCB1CTL1            UCB1CTLW0_L  /* USCI B1 Control Register 1 */
#define UCB1CTL0            UCB1CTLW0_H  /* USCI B1 Control Register 0 */
#define UCB1BRW_            (0x0626u)  /* USCI B1 Baud Word Rate 0 */
DEFCW(  UCB1BRW           , UCB1BRW_)
#define UCB1BR0             UCB1BRW_L /* USCI B1 Baud Rate 0 */
#define UCB1BR1             UCB1BRW_H /* USCI B1 Baud Rate 1 */
#define UCB1STAT_           (0x062Au)  /* USCI B1 Status Register */
DEFC(   UCB1STAT          , UCB1STAT_)
#define UCB1RXBUF_          (0x062Cu)  /* USCI B1 Receive Buffer */
READ_ONLY DEFC( UCB1RXBUF      , UCB1RXBUF_)
#define UCB1TXBUF_          (0x062Eu)  /* USCI B1 Transmit Buffer */
DEFC(   UCB1TXBUF         , UCB1TXBUF_)
#define UCB1I2COA_          (0x0630u)  /* USCI B1 I2C Own Address */
DEFCW(  UCB1I2COA         , UCB1I2COA_)
#define UCB1I2CSA_          (0x0632u)  /* USCI B1 I2C Slave Address */
DEFCW(  UCB1I2CSA         , UCB1I2CSA_)
#define UCB1ICTL_           (0x063Cu)  /* USCI B1 Interrupt Enable Register */
DEFCW(  UCB1ICTL          , UCB1ICTL_)
#define UCB1IE              UCB1ICTL_L  /* USCI B1 Interrupt Enable Register */
#define UCB1IFG             UCB1ICTL_H  /* USCI B1 Interrupt Flags Register */
#define UCB1IV_             (0x063Eu)  /* USCI B1 Interrupt Vector Register */
DEFW(   UCB1IV            , UCB1IV_)

/************************************************************
* USCI A2
************************************************************/
#define __MSP430_HAS_USCI_A2__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A2__ 0x0640

#define UCA2CTLW0_          (0x0640u)  /* USCI A2 Control Word Register 0 */
DEFCW(  UCA2CTLW0         , UCA2CTLW0_)
#define UCA2CTL1            UCA2CTLW0_L  /* USCI A2 Control Register 1 */
#define UCA2CTL0            UCA2CTLW0_H  /* USCI A2 Control Register 0 */
#define UCA2BRW_            (0x0646u)  /* USCI A2 Baud Word Rate 0 */
DEFCW(  UCA2BRW           , UCA2BRW_)
#define UCA2BR0             UCA2BRW_L /* USCI A2 Baud Rate 0 */
#define UCA2BR1             UCA2BRW_H /* USCI A2 Baud Rate 1 */
#define UCA2MCTL_           (0x0648u)  /* USCI A2 Modulation Control */
DEFC(   UCA2MCTL          , UCA2MCTL_)
#define UCA2STAT_           (0x064Au)  /* USCI A2 Status Register */
DEFC(   UCA2STAT          , UCA2STAT_)
#define UCA2RXBUF_          (0x064Cu)  /* USCI A2 Receive Buffer */
READ_ONLY DEFC( UCA2RXBUF      , UCA2RXBUF_)
#define UCA2TXBUF_          (0x064Eu)  /* USCI A2 Transmit Buffer */
DEFC(   UCA2TXBUF         , UCA2TXBUF_)
#define UCA2ABCTL_          (0x0650u)  /* USCI A2 LIN Control */
DEFC(   UCA2ABCTL         , UCA2ABCTL_)
#define UCA2IRCTL_          (0x0652u)  /* USCI A2 IrDA Transmit Control */
DEFCW(  UCA2IRCTL         , UCA2IRCTL_)
#define UCA2IRTCTL          UCA2IRCTL_L  /* USCI A2 IrDA Transmit Control */
#define UCA2IRRCTL          UCA2IRCTL_H  /* USCI A2 IrDA Receive Control */
#define UCA2ICTL_           (0x065Cu)  /* USCI A2 Interrupt Enable Register */
DEFCW(  UCA2ICTL          , UCA2ICTL_)
#define UCA2IE              UCA2ICTL_L  /* USCI A2 Interrupt Enable Register */
#define UCA2IFG             UCA2ICTL_H  /* USCI A2 Interrupt Flags Register */
#define UCA2IV_             (0x065Eu)  /* USCI A2 Interrupt Vector Register */
DEFW(   UCA2IV            , UCA2IV_)


/************************************************************
* USCI B2
************************************************************/
#define __MSP430_HAS_USCI_B2__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B2__ 0x0660


#define UCB2CTLW0_          (0x0660u)  /* USCI B2 Control Word Register 0 */
DEFCW(  UCB2CTLW0         , UCB2CTLW0_)
#define UCB2CTL1            UCB2CTLW0_L  /* USCI B2 Control Register 1 */
#define UCB2CTL0            UCB2CTLW0_H  /* USCI B2 Control Register 0 */
#define UCB2BRW_            (0x0666u)  /* USCI B2 Baud Word Rate 0 */
DEFCW(  UCB2BRW           , UCB2BRW_)
#define UCB2BR0             UCB2BRW_L /* USCI B2 Baud Rate 0 */
#define UCB2BR1             UCB2BRW_H /* USCI B2 Baud Rate 1 */
#define UCB2STAT_           (0x066Au)  /* USCI B2 Status Register */
DEFC(   UCB2STAT          , UCB2STAT_)
#define UCB2RXBUF_          (0x066Cu)  /* USCI B2 Receive Buffer */
READ_ONLY DEFC( UCB2RXBUF      , UCB2RXBUF_)
#define UCB2TXBUF_          (0x066Eu)  /* USCI B2 Transmit Buffer */
DEFC(   UCB2TXBUF         , UCB2TXBUF_)
#define UCB2I2COA_          (0x0670u)  /* USCI B2 I2C Own Address */
DEFCW(  UCB2I2COA         , UCB2I2COA_)
#define UCB2I2CSA_          (0x0672u)  /* USCI B2 I2C Slave Address */
DEFCW(  UCB2I2CSA         , UCB2I2CSA_)
#define UCB2ICTL_           (0x067Cu)  /* USCI B2 Interrupt Enable Register */
DEFCW(  UCB2ICTL          , UCB2ICTL_)
#define UCB2IE              UCB2ICTL_L  /* USCI B2 Interrupt Enable Register */
#define UCB2IFG             UCB2ICTL_H  /* USCI B2 Interrupt Flags Register */
#define UCB2IV_             (0x067Eu)  /* USCI B2 Interrupt Vector Register */
DEFW(   UCB2IV            , UCB2IV_)

/************************************************************
* USCI A3
************************************************************/
#define __MSP430_HAS_USCI_A3__       /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_A3__ 0x0680

#define UCA3CTLW0_          (0x0680u)  /* USCI A3 Control Word Register 0 */
DEFCW(  UCA3CTLW0         , UCA3CTLW0_)
#define UCA3CTL1            UCA3CTLW0_L  /* USCI A3 Control Register 1 */
#define UCA3CTL0            UCA3CTLW0_H  /* USCI A3 Control Register 0 */
#define UCA3BRW_            (0x0686u)  /* USCI A3 Baud Word Rate 0 */
DEFCW(  UCA3BRW           , UCA3BRW_)
#define UCA3BR0             UCA3BRW_L /* USCI A3 Baud Rate 0 */
#define UCA3BR1             UCA3BRW_H /* USCI A3 Baud Rate 1 */
#define UCA3MCTL_           (0x0688u)  /* USCI A3 Modulation Control */
DEFC(   UCA3MCTL          , UCA3MCTL_)
#define UCA3STAT_           (0x068Au)  /* USCI A3 Status Register */
DEFC(   UCA3STAT          , UCA3STAT_)
#define UCA3RXBUF_          (0x068Cu)  /* USCI A3 Receive Buffer */
READ_ONLY DEFC( UCA3RXBUF      , UCA3RXBUF_)
#define UCA3TXBUF_          (0x068Eu)  /* USCI A3 Transmit Buffer */
DEFC(   UCA3TXBUF         , UCA3TXBUF_)
#define UCA3ABCTL_          (0x0690u)  /* USCI A3 LIN Control */
DEFC(   UCA3ABCTL         , UCA3ABCTL_)
#define UCA3IRCTL_          (0x0692u)  /* USCI A3 IrDA Transmit Control */
DEFCW(  UCA3IRCTL         , UCA3IRCTL_)
#define UCA3IRTCTL          UCA3IRCTL_L  /* USCI A3 IrDA Transmit Control */
#define UCA3IRRCTL          UCA3IRCTL_H  /* USCI A3 IrDA Receive Control */
#define UCA3ICTL_           (0x069Cu)  /* USCI A3 Interrupt Enable Register */
DEFCW(  UCA3ICTL          , UCA3ICTL_)
#define UCA3IE              UCA3ICTL_L  /* USCI A3 Interrupt Enable Register */
#define UCA3IFG             UCA3ICTL_H  /* USCI A3 Interrupt Flags Register */
#define UCA3IV_             (0x069Eu)  /* USCI A3 Interrupt Vector Register */
DEFW(   UCA3IV            , UCA3IV_)


/************************************************************
* USCI B3
************************************************************/
#define __MSP430_HAS_USCI_B3__        /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_USCI_B3__ 0x06A0


